#include<iostream>
#include"00 函数.h"
int main() {
	//常用遍历算法
	//test11(); //for_each实现遍历容器
	//test12();//transform实现搬运
	
	//常用查找算法
	//test21();//find查找指定数据
	//test22();//find_if查找指定元素
	//test23();//查找相邻重复元素
	//test24();//查找指定元素搜索是否存在
	//test25();//统计元素个数
	//test26();//按条件统计元素个数
	
	// 排序算法
	//test31();//sort排序
	//test32();//洗牌 打乱排序
	//test33();//merge 合并两个容器
	//test34();//将容器内容进行反转
	
	//常用拷贝和替换算法
	//test41();//指定范围拷贝
	//test42();//将指定范围内的旧数据修改为新的元素
	//test43();//按条件替换
	//test44();//容器内容交换

	//常用算术生成算法
	//test51();//计算容器元素指定范围与指定值累计总和
	//test52();//指定范围填充值
	//test61();//集合交集
	//test62();//集合并集
	test63();//集合差集
	system("pause");
	return 0;
}